fonecmid-diplom/src/Catalogs/ДоговорыКонтрагентов/ДоговорыКонтрагентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ДоговорыКонтрагентов</name>
  <owners>Catalog.Контрагенты</owners>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидДоговора</name>
    <type>
      <types>EnumRef.ВидыДоговоровКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_ДатаНачалаДействия</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_ДатаОкончанияДействия</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_СуммаАбонентскойПлаты</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_СтоимостьЧасаРаботы</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

fonecmid-diplom/src/CommonModules/ВКМ_РаботаСФормойСервер/Module.bsl
#Область ПрограммныйИнтерфейс

// Выводит элементы добавленных реквизитов с префиксом ВКМ_ на форму.
//
// Параметры:
//   Форма - ФормаКлиентскогоПриложения - форма, в которой необходимо разместить элементы реквизитов.
//
Процедура ДополнениеФормы(Форма)Экспорт 
	
	ИмяФормы = Форма.ИмяФормы;
	
	Если ИмяФормы = "Справочник.ДоговорыКонтрагентов.Форма.ФормаЭлемента" Тогда
		
		ДобавитьГруппуНаФорму(Форма,"ГруппаПериод");
		ДобавитьРеквизитДатаНачалаНаФорму(Форма);
		ДобавитьРеквизитДатаОкончанияНаФорму(Форма);
		ДобавитьГруппуНаФорму(Форма,"ГруппаРасчет");	
		ДобавитьРеквизитСуммаАбонентскойПлатыНаФорму(Форма);
		ДобавитьРеквизитСтоимостьЧасаРаботыНаФорму(Форма);
		
	КонецЕсли; 
	
	Если ИмяФормы = "Документ.РеализацияТоваровУслуг.Форма.ФормаДокумента" Тогда
		ДобавитьКомандуЗаполнить(Форма);
	КонецЕсли; 
	
КонецПроцедуры 

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ДобавитьГруппуНаФорму(Форма, ИмяГруппы);
	
	Группа = Форма.Элементы.Добавить(ИмяГруппы, Тип("ГруппаФормы"));
	Группа.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	Группа.Группировка = ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда;
	Группа.Отображение = ОтображениеОбычнойГруппы.Нет;
	
КонецПроцедуры

Процедура ДобавитьРеквизитДатаНачалаНаФорму(Форма);
	
	НовыйЭлемент = Форма.Элементы.Добавить("ДатаНачалаДействия",Тип("ПолеФормы"),Форма.Элементы.ГруппаПериод);
	НовыйЭлемент.ПутьКДанным = "Объект.ВКМ_ДатаНачалаДействия";
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.Заголовок = "Дата начала действия";
	
КонецПроцедуры

Процедура ДобавитьРеквизитДатаОкончанияНаФорму(Форма);
	
	НовыйЭлемент = Форма.Элементы.Добавить("ДатаОкончанияДействия",Тип("ПолеФормы"),Форма.Элементы.ГруппаПериод);
	НовыйЭлемент.ПутьКДанным = "Объект.ВКМ_ДатаОкончанияДействия";
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.Заголовок = "Дата окончания действия";
	
КонецПроцедуры 

Процедура ДобавитьРеквизитСуммаАбонентскойПлатыНаФорму(Форма);
	
	НовыйЭлемент = Форма.Элементы.Добавить("СуммаАбонентскойПлаты",Тип("ПолеФормы"),Форма.Элементы.ГруппаРасчет);
	НовыйЭлемент.ПутьКДанным = "Объект.ВКМ_СуммаАбонентскойПлаты";
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.Заголовок = "Сумма абонентской платы";
	
КонецПроцедуры 

Процедура ДобавитьРеквизитСтоимостьЧасаРаботыНаФорму(Форма);
	
	НовыйЭлемент = Форма.Элементы.Добавить("СтоимостьЧасаРаботы",Тип("ПолеФормы"),Форма.Элементы.ГруппаРасчет);
	НовыйЭлемент.ПутьКДанным = "Объект.ВКМ_СтоимостьЧасаРаботы";
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.Заголовок = "Стоимость часа работы";
	
КонецПроцедуры  

Процедура ДобавитьКомандуЗаполнить(Форма);
	
	КомандаЗаполнить = Форма.Команды.Добавить("Заполнить");
	КомандаЗаполнить.Заголовок = "Заполнить";
	КомандаЗаполнить.Отображение = ОтображениеКнопки.Текст;
	КомандаЗаполнить.Действие = "Заполнить";
	
	КнопкаКоманды = Форма.Элементы.Добавить("КнопкаЗаполнить",Тип("КнопкаФормы"), Форма.Элементы.ГруппаШапкаЛево);
	КнопкаКоманды.ИмяКоманды = "Заполнить";
	КнопкаКоманды.Вид = ВидКнопкиФормы.КнопкаКоманднойПанели;
	
КонецПроцедуры 

 #КонецОбласти
